apache/nuttx/arch/arm/src/stm32wb/stm32wb_serial.c
  .irq           = STM32_IRQ_LPUART1,
  .parity        = CONFIG_LPUART1_PARITY,
  .bits          = CONFIG_LPUART1_BITS,
  .stopbits2     = CONFIG_LPUART1_2STOP,
  .baud          = CONFIG_LPUART1_BAUD,
  .apbclock      = STM32_PCLK1_FREQUENCY,
  .usartbase     = STM32_LPUART1_BASE,
  .tx_gpio       = GPIO_LPUART1_TX,
  .rx_gpio       = GPIO_LPUART1_RX,
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART1_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_LPUART1_CTS,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART1_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_LPUART1_RTS,
#endif
#ifdef CONFIG_LPUART1_RXDMA
  .rxdma_channel = DMAMAP_LPUART1_RX,
  .rxfifo        = g_lpuart1rxfifo,
#endif

#ifdef CONFIG_LPUART1_RS485
  .rs485_dir_gpio = GPIO_LPUART1_RS485_DIR,
#  if (CONFIG_USART1_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock               = SP_UNLOCKED,
};
#endif

/* This describes the state of the STM32WB USART1 port. */

#ifdef CONFIG_STM32WB_USART1_SERIALDRIVER
static struct stm32_serial_s g_usart1priv =
{
  .dev =
    {
#if CONSOLE_UART == 2
      .isconsole = true,
#endif
      .recv      =
      {
        .size    = CONFIG_USART1_RXBUFSIZE,
        .buffer  = g_usart1rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_USART1_TXBUFSIZE,
        .buffer  = g_usart1txbuffer,
      },
#ifdef CONFIG_USART1_RXDMA
      .ops       = &g_uart_dma_ops,
#else
      .ops       = &g_uart_ops,
#endif
      .priv      = &g_usart1priv,
    },

  .irq           = STM32_IRQ_USART1,
  .parity        = CONFIG_USART1_PARITY,
  .bits          = CONFIG_USART1_BITS,
  .stopbits2     = CONFIG_USART1_2STOP,
  .baud          = CONFIG_USART1_BAUD,
  .apbclock      = STM32_PCLK2_FREQUENCY,
  .usartbase     = STM32_USART1_BASE,
  .tx_gpio       = GPIO_USART1_TX,
  .rx_gpio       = GPIO_USART1_RX,
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART1_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_USART1_CTS,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART1_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_USART1_RTS,
#endif
#ifdef CONFIG_USART1_RXDMA
  .rxdma_channel = DMAMAP_USART1_RX,
  .rxfifo        = g_usart1rxfifo,
#endif

#ifdef CONFIG_USART1_RS485
  .rs485_dir_gpio = GPIO_USART1_RS485_DIR,
#  if (CONFIG_USART1_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock               = SP_UNLOCKED,
};
#endif

/* This table lets us iterate over the configured USARTs */

static struct stm32_serial_s *
const g_uart_devs[STM32_NLPUART + STM32_NUSART] =
{
#ifdef CONFIG_STM32WB_LPUART1_SERIALDRIVER
  [0] = &g_lpuart1priv,
#endif
#ifdef CONFIG_STM32WB_USART1_SERIALDRIVER
  [1] = &g_usart1priv,
#endif
};

#ifdef CONFIG_PM
static struct
{
  struct pm_callback_s pm_cb;
  bool serial_suspended;
} g_serialpm =
  {
    .pm_cb.notify  = stm32_serial_pmnotify,
    .pm_cb.prepare = stm32_serial_pmprepare,
    .serial_suspended = false
  };
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_serial_getreg
 ****************************************************************************/

static inline
uint32_t stm32_serial_getreg(struct stm32_serial_s *priv, int offset)
{
  return getreg32(priv->usartbase + offset);
}

/****************************************************************************
 * Name: stm32_serial_putreg
 ****************************************************************************/

static inline void stm32_serial_putreg(struct stm32_serial_s *priv,
                                         int offset, uint32_t value)
{
  putreg32(value, priv->usartbase + offset);
}

/****************************************************************************
 * Name: stm32_serial_setusartint
 ****************************************************************************/

static inline
void stm32_serial_setusartint(struct stm32_serial_s *priv, uint16_t ie)
{
  uint32_t cr;

  /* Save the interrupt mask */

  priv->ie = ie;

  /* And restore the interrupt state (see the interrupt
   * enable/usage table above)
   */

  cr = stm32_serial_getreg(priv, STM32_USART_CR1_OFFSET);
  cr &= ~(USART_CR1_USED_INTS);
  cr |= (ie & (USART_CR1_USED_INTS));
  stm32_serial_putreg(priv, STM32_USART_CR1_OFFSET, cr);

  cr = stm32_serial_getreg(priv, STM32_USART_CR3_OFFSET);
  cr &= ~USART_CR3_EIE;
  cr |= (ie & USART_CR3_EIE);
  stm32_serial_putreg(priv, STM32_USART_CR3_OFFSET, cr);
}

/****************************************************************************
 * Name: up_restoreusartint
 ****************************************************************************/

static void stm32_serial_restoreusartint(struct stm32_serial_s *priv,
                                           uint16_t ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  stm32_serial_setusartint(priv, ie);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: stm32_serial_disableusartint
 ****************************************************************************/

static void stm32_serial_disableusartint(struct stm32_serial_s *priv,
                                           uint16_t *ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  if (ie)
    {
      uint32_t cr1;
      uint32_t cr3;

      /* USART interrupts:
       *
       * Enable             Status          Meaning            Usage
       * ------------------ --------------- ------------------ ----------
       * USART_CR1_IDLEIE   USART_ISR_IDLE   Idle Line
       *                                     Detected          (not used)
       * USART_CR1_RXNEIE   USART_ISR_RXNE   Received Data
       *                                     Ready to be Read
       * "              "   USART_ISR_ORE    Overrun Error
       *                                     Detected
       * USART_CR1_TCIE     USART_ISR_TC     Transmission
       *                                     Complete          (used only
       *                                                        for RS-485)
       * USART_CR1_TXEIE    USART_ISR_TXE    Transmit Data
       *                                     Register Empty
       * USART_CR1_PEIE     USART_ISR_PE     Parity Error
       *
       * USART_CR2_LBDIE    USART_ISR_LBD    Break Flag        (not used)
       * USART_CR3_EIE      USART_ISR_FE     Framing Error
       * "           "      USART_ISR_NE     Noise Flag
       * "           "      USART_ISR_ORE    Overrun Error
       *                                     Detected
       * USART_CR3_CTSIE    USART_ISR_CTS    CTS flag          (not used)
       */

