apache/nuttx/arch/arm/src/stm32wb/stm32wb_serial.c
      cr1 = stm32_serial_getreg(priv, STM32_USART_CR1_OFFSET);
      cr3 = stm32_serial_getreg(priv, STM32_USART_CR3_OFFSET);

      /* Return the current interrupt mask value for the used interrupts.
       * Notice that this depends on the fact that none of the used interrupt
       * enable bits overlap. This logic would fail if we needed the break
       * interrupt!
       */

      *ie = (cr1 & (USART_CR1_USED_INTS)) | (cr3 & USART_CR3_EIE);
    }

  /* Disable all interrupts */

  stm32_serial_setusartint(priv, 0);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: stm32_serial_dmanextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static int stm32_serial_dmanextrx(struct stm32_serial_s *priv)
{
  size_t dmaresidual;

  dmaresidual = stm32_dmaresidual(priv->rxdma);

  return (RXDMA_BUFFER_SIZE - (int)dmaresidual);
}
#endif

/****************************************************************************
 * Name: stm32_serial_setbaud_usart
 *
 * Description:
 *   Set the serial line baud rate (USART only).
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void stm32_serial_setbaud_usart(struct stm32_serial_s *priv)
{
  /* This first implementation is for U[S]ARTs that support oversampling
   * by 8 in additional to the standard oversampling by 16.
   */

  uint32_t usartdiv8;
  uint32_t cr1;
  uint32_t brr;

  /* In case of oversampling by 8, the equation is:
   *
   *   baud      = 2 * fCK / usartdiv8
   *   usartdiv8 = 2 * fCK / baud
   */

  usartdiv8 = ((priv->apbclock << 1) + (priv->baud >> 1)) / priv->baud;

  /* Baud rate for standard USART (SPI mode included):
   *
   * In case of oversampling by 16, the equation is:
   *   baud       = fCK / usartdiv16
   *   usartdiv16 = fCK / baud
   *              = 2 * usartdiv8
   */

  /* Use oversamply by 8 only if the divisor is small.  But what is small? */

  cr1 = stm32_serial_getreg(priv, STM32_USART_CR1_OFFSET);
  brr = stm32_serial_getreg(priv, STM32_USART_BRR_OFFSET);
  brr &= ~(USART_BRR_MANT_MASK | USART_BRR_FRAC_MASK);

  if (usartdiv8 > 100)
    {
      /* Use usartdiv16 */

      brr  |= (usartdiv8 + 1) >> 1;

      /* Clear oversampling by 8 to enable oversampling by 16 */

      cr1 &= ~USART_CR1_OVER8;
    }
  else
    {
      DEBUGASSERT(usartdiv8 >= 8);

      /* Perform mysterious operations on bits 0-3 */

      brr  |= ((usartdiv8 & 0xfff0) | ((usartdiv8 & 0x000f) >> 1));

      /* Set oversampling by 8 */

      cr1 |= USART_CR1_OVER8;
    }

  stm32_serial_putreg(priv, STM32_USART_CR1_OFFSET, cr1);
  stm32_serial_putreg(priv, STM32_USART_BRR_OFFSET, brr);
}
#endif

/****************************************************************************
 * Name: stm32_serial_setbaud_lpuart
 *
 * Description:
 *   Set the serial line baud rate (LPUART only).
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
#ifdef CONFIG_STM32WB_LPUART1_SERIALDRIVER
static void stm32_serial_setbaud_lpuart(struct stm32_serial_s *priv)
{
  uint32_t brr;

  /* The equation is:
   *
   *   baud = 256 * fCK / brr
   *   brr  = 256 * fCK / baud
   *
   * It is forbidden to write values lower than LPUART_BRR_MIN in
   * the LPUART_BRR register. fCK must range from 3 x baud rate to
   * 4096 x baud rate.
   */

  brr = (((uint64_t)priv->apbclock << 8) + (priv->baud >> 1)) / priv->baud;
  brr &= LPUART_BRR_MASK;

  if (brr < LPUART_BRR_MIN)
    {
      brr = LPUART_BRR_MIN;
    }

  stm32_serial_putreg(priv, STM32_USART_BRR_OFFSET, brr);
}
#endif
#endif

/****************************************************************************
 * Name: stm32_serial_setformat
 *
 * Description:
 *   Set the serial line format and speed.
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void stm32_serial_setformat(struct uart_dev_s *dev)
{
  struct stm32_serial_s *priv = (struct stm32_serial_s *)dev->priv;
  uint32_t regval;

  /* Set baud rate */

#ifdef CONFIG_STM32WB_LPUART1_SERIALDRIVER
  if (priv->usartbase == STM32_LPUART1_BASE)
    {
      stm32_serial_setbaud_lpuart(priv);
    }
  else
#endif
    {
      stm32_serial_setbaud_usart(priv);
    }

  /* Configure parity mode */

  regval  = stm32_serial_getreg(priv, STM32_USART_CR1_OFFSET);
  regval &= ~(USART_CR1_PCE | USART_CR1_PS | USART_CR1_M0 | USART_CR1_M1);

  if (priv->parity == 1)       /* Odd parity */
    {
      regval |= (USART_CR1_PCE | USART_CR1_PS);
    }
  else if (priv->parity == 2)  /* Even parity */
    {
      regval |= USART_CR1_PCE;
    }

  /* Configure word length (parity uses one of configured bits)
   *
   * Default: 1 start, 8 data (no parity), n stop, OR
   *          1 start, 7 data + parity, n stop
   */

  if (priv->bits == 9 || (priv->bits == 8 && priv->parity != 0))
    {
      /* Select: 1 start, 8 data + parity, n stop, OR
       *         1 start, 9 data (no parity), n stop.
       */

      regval |= USART_CR1_M0;
    }
  else if (priv->bits == 7 && priv->parity == 0)
    {
      /* Select: 1 start, 7 data (no parity), n stop, OR
       */

      regval |= USART_CR1_M1;
    }

  /* Else Select: 1 start, 7 data + parity, n stop, OR
   *              1 start, 8 data (no parity), n stop.
   */

  stm32_serial_putreg(priv, STM32_USART_CR1_OFFSET, regval);

  /* Configure STOP bits */

  regval = stm32_serial_getreg(priv, STM32_USART_CR2_OFFSET);
  regval &= ~(USART_CR2_STOP_MASK);

  if (priv->stopbits2)
    {
      regval |= USART_CR2_STOP2;
    }

  stm32_serial_putreg(priv, STM32_USART_CR2_OFFSET, regval);

  /* Configure hardware flow control */

  regval  = stm32_serial_getreg(priv, STM32_USART_CR3_OFFSET);
  regval &= ~(USART_CR3_CTSE | USART_CR3_RTSE);

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && !defined(CONFIG_STM32WB_FLOWCONTROL_BROKEN)
  if (priv->iflow && (priv->rts_gpio != 0))
    {
      regval |= USART_CR3_RTSE;
    }
#endif

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->oflow && (priv->cts_gpio != 0))
    {
      regval |= USART_CR3_CTSE;
    }
#endif

  stm32_serial_putreg(priv, STM32_USART_CR3_OFFSET, regval);
}
#endif /* CONFIG_SUPPRESS_UART_CONFIG */

/****************************************************************************
 * Name: stm32_serial_setsuspend
 *
 * Description:
 *   Suspend or resume serial peripheral.
 *
 ****************************************************************************/

