apache/nuttx/arch/arm/src/stm32wb/stm32wb_serial.c
#ifdef SERIAL_HAVE_RXDMA
static void stm32_serial_dmarxcallback(DMA_HANDLE handle, uint8_t status,
                                         void *arg)
{
  struct stm32_serial_s *priv = (struct stm32_serial_s *)arg;

  if (priv->rxenable && stm32_serial_dmarxavailable(&priv->dev))
    {
      uart_recvchars(&priv->dev);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
      if (priv->iflow)
        {
          /* Re-enable RX DMA. */

          stm32_serial_dmaiflowrestart(priv);
        }
#endif
    }

  /* Get the masked USART status word to check and clear error flags.
   *
   * When wake-up from low power mode was not fast enough, UART is resumed
   * too late and sometimes exactly when character was coming over UART,
   * resulting to frame error.

   * If error flag is not cleared, Rx DMA will be stuck. Clearing errors
   * will release Rx DMA.
   */

  priv->sr = stm32_serial_getreg(priv, STM32_USART_ISR_OFFSET);

  if ((priv->sr & (USART_ISR_ORE | USART_ISR_NE | USART_ISR_FE)) != 0)
    {
      stm32_serial_putreg(priv, STM32_USART_ICR_OFFSET,
                            (USART_ICR_NCF | USART_ICR_ORECF |
                             USART_ICR_FECF));
    }
}
#endif

/****************************************************************************
 * Name: stm32_serial_pmnotify
 *
 * Description:
 *   Notify the driver of new power state. This callback is  called after
 *   all drivers have had the opportunity to prepare for the new power state.
 *
 * Input Parameters:
 *
 *    cb - Returned to the driver. The driver version of the callback
 *         structure may include additional, driver-specific state data at
 *         the end of the structure.
 *
 *    pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   None - The driver already agreed to transition to the low power
 *   consumption state when when it returned OK to the prepare() call.
 *
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static void stm32_serial_pmnotify(struct pm_callback_s *cb, int domain,
                                    enum pm_state_e pmstate)
{
  switch (pmstate)
    {
      case PM_NORMAL:
        stm32_serial_pm_setsuspend(false);
        break;

      case PM_IDLE:
        stm32_serial_pm_setsuspend(false);
        break;

      case PM_STANDBY:
        /* TODO: Alternative configuration and logic for enabling serial in
         *       Stop 1 mode with HSI16 missing. Current logic allows
         *       suspending serial peripherals for Stop 0/1/2 when serial
         *       Rx/Tx buffers are empty (checked in pmprepare).
         */

        stm32_serial_pm_setsuspend(true);
        break;

      case PM_SLEEP:
        stm32_serial_pm_setsuspend(true);
        break;

      default:
        DEBUGPANIC();
        break;
    }
}
#endif

/****************************************************************************
 * Name: stm32_serial_pmprepare
 *
 * Description:
 *   Request the driver to prepare for a new power state. This is a warning
 *   that the system is about to enter into a new power state. The driver
 *   should begin whatever operations that may be required to enter power
 *   state. The driver may abort the state change mode by returning a
 *   non-zero value from the callback function.
 *
 * Input Parameters:
 *
 *    cb - Returned to the driver. The driver version of the callback
 *         structure may include additional, driver-specific state data at
 *         the end of the structure.
 *
 *    pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   Zero - (OK) means the event was successfully processed and that the
 *          driver is prepared for the PM state change.
 *
 *   Non-zero - means that the driver is not prepared to perform the tasks
 *              needed achieve this power setting and will cause the state
 *              change to be aborted. NOTE: The prepare() method will also
 *              be called when reverting from lower back to higher power
 *              consumption modes (say because another driver refused a
 *              lower power state change). Drivers are not permitted to
 *              return non-zero values when reverting back to higher power
 *              consumption modes!
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static int stm32_serial_pmprepare(struct pm_callback_s *cb, int domain,
                                    enum pm_state_e pmstate)
{
  int n;

  /* Logic to prepare for a reduced power state goes here. */

  switch (pmstate)
    {
      case PM_NORMAL:
      case PM_IDLE:
        break;

      case PM_STANDBY:
      case PM_SLEEP:

#ifdef SERIAL_HAVE_RXDMA
        /* Flush Rx DMA buffers before checking state of serial device
         * buffers.
         */

        stm32_serial_dma_poll();
#endif

        /* Check if any of the active ports have data pending on Tx/Rx
         * buffers.
         */

        for (n = 0; n < STM32_NLPUART + STM32_NUSART; n++)
          {
            struct stm32_serial_s *priv = g_uart_devs[n];

            if (!priv || !priv->initialized)
              {
                /* Not active, skip. */

                continue;
              }

            if (priv->suspended)
              {
                /* Port already suspended, skip. */

                continue;
              }

            /* Check if port has data pending (Rx & Tx). */

            if (priv->dev.xmit.head != priv->dev.xmit.tail)
              {
                return ERROR;
              }

            if (priv->dev.recv.head != priv->dev.recv.tail)
              {
                return ERROR;
              }
          }
        break;

      default:
        DEBUGPANIC();
        break;
    }

  return OK;
}
#endif

#endif /* HAVE_UART */
#endif /* USE_SERIALDRIVER */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

